<template>
  <v-container>
    <v-row class="mt-16">
      <v-col cols="12" xl="6" md="6" sm="12" xs="12">
        <p>
          Для отображения сделать минимальное SPA-приложение с использованием Vue.js, работающее с разработанным API. </p>
        <br>

          Форма добавления записей, содержащая:
        <br>
        <br>
        <div>
          <ul>
            <li>1.	Список «Тип оборудования» (id типа) select.</li>
            <li>2.	поле «Серийные номера» input-text/textarea.</li>
            <li>3.	Поле «Примечание» textarea</li>
            <li>4.	Кнопка «Добавить».</li>
          </ul>
        </div>

        <br>
        <p>
          Форма поиска, редактирования и удаления записей:
        </p>

        <div>
          <ul>
            <li>1.	Поисковая строка input-text, для поиск по серийному номеру/примечанию.</li>
            <li>2.	Поле «Код оборудования» (id) — input-text.</li>
            <li>3.	Поле «Тип оборудования» (наименование) — input-text/select.</li>
            <li>4.	Поле «Серийный номер» — input-text.</li>
            <li>5.	Поле «Примечание» — input-text/textarea.</li>
            <li>6.	Кнопки редактировать/сохранить/удалить в зависимости от выдранного режима (просмотр/редактирование).</li>
          </ul>
        </div>

        <br>
        <p>
          В качестве ui kit можно использовать любой готовый фреймворк/библиотеку.
          Редактирование может быть реализовано как в целом всех полей, так и отдельными полями.
          Для всех форм обязательно наличие минимальной валидации данных на стороне клиента.
        </p>
      </v-col>


    </v-row>
  </v-container>
</template>

<script>
export default {
  name: "Welcome"
}
</script>

<style scoped>

</style>